Repository: nicklambson/bitcoin-multilingual
Catalog: alignments/bitcoin-is-time/Bitcoin is Time_es.tmx
Source language: en_us
Languages: es

source: How else can you make sure that things are in order?
es: ¿De qué otra manera podrías estar seguro que las cosas están en orden?

source: The distinction between tokens and ledgers highlights the necessity for keeping track of time.
es: La distinción entre tokens y libros contables maximiza la necesidad de hacer un seguimiento del tiempo.

source: In the physical realm, coins are timeless artifacts that can be exchanged without oversight.
es: En el mundo físico, las monedas son objetos sin tiempo que pueden ser cambiados sin supervisión.

source: In the digital realm, coinstamping requires timestamping.
es: En el mundo digital, seguir monedas requiere seguir al tiempo.

source: Centralized Coinstamping
es: Seguimiento de monedas centralizado

source: Time: a great engraver, or eraser.
es: Tiempo: el gran grabador, o borrador.

source: The common way to solve the double-spending problem — the problem of making sure that a digital transfer only happens once — is to have a central list of transactions.
es: La manera más común de resolver el problema del doble-gasto -el problema de asegurarnos de que una transferencia digital solo sucedió una vez- es tener una lista central de transacciones.

source: Once you have a central list of transactions, you have a single ledger that can act as the sole source of truth.
es: Una vez que tienes una lista central de transacciones, tienes un único libro contable que hace de la única fuente de la verdad.

source: Solving the double-spending problem is as easy as going through the list and making sure that everything adds up correctly.
es: Resolver el problema del doble-gasto es tan fácil como recorrer la lista y asegurarse de que todo se suma correctamente.

source: This is how PayPal, Venmo, Alipay, and all the banks of this world — including central banks — solve the double-spending problem: via central authority.
es: Así es como PayPal, Venmo, Alipay, y todos los bancos de este mundo -incluídos los bancos centrales- resuelven el problema del doble-gasto: a través de una autoridad central.

source: The problem of course is the payee can’t verify that one of the owners did not double-spend the coin.
es: "El problema, por supuesto, es que el beneficiario no puede verificar que uno de los propietarios no haya gastado dos veces la moneda.

source: A common solution is to introduce a trusted central authority, or mint, that checks every transaction for double-spending.
es: Una solución común es introducir una autoridad central confiable, o casa de la moneda, que verifique cada transacción para detectar el doble-gasto.

source: […] The problem with this solution is that the fate of the entire money system depends on the company running the mint, with every transaction having to go through them, just like a bank.
es: El problema con esta solución es que el destino de todo el sistema monetario depende de la empresa que maneja la casa de la moneda, y cada transacción debe pasar por ellos, como un banco.”

source: It is worth pointing out that Satoshi didn’t manage to make information non-copyable.
es: Es importante aclarar que Satoshi no logró hacer la información incopiable.

source: Every part of bitcoin — its source code, the ledger, your private key — can be copied.
es: Cada parte de bitcoin -su código fuente, el libro contable, tu clave privada- puede ser copiada.

source: All of it can be duplicated and tampered with.
es: Todo bitcoin puede ser copiado y manipulado.

source: However, Satoshi managed to build a system that makes rule-breaking copies completely and utterly useless.
es: Sin embargo, Satoshi logró construir un sistema que convierte a las copias que rompen las reglas absolutamente inútiles.

source: The Bitcoin network performs an intricate dance to decide which copies are useful and which aren’t, and it is this dance that brings scarcity into the digital realm.
es: La red Bitcoin hace un baile complejo para decidir qué copias son útiles y cuáles no, y es este baile el que logra introducir escasez al reino digital.

source: And like with every dance, a temporal measuring stick is required to dictate the rhythm.
es: Y como todo baile, un cronómetro que mide el tiempo es necesario para marcar el ritmo.

source: Even a centralized ledger can only solve the double-spending problem if it has a consistent way to keep track of time.
es: Incluso un libro contable centralizado solo puede resolver el problema del doble-gasto si tiene una forma consistente de medir el tiempo.

source: You always need to know who gave how much to whom and, most importantly: when.
es: Siempre tienes que saber quién le dio cuanto a quién y, más importante: cuando.

source: In the realm of information, there is no coin-stamping without time-stamping.
es: En el reino de la información, no hay seguimiento de moneda sin seguimiento del tiempo.

source: It must be stressed that the impossibility of associating events with points in time in distributed systems was the unsolved problem that precluded a decentralized ledger from ever being possible until Satoshi Nakamoto invented a solution.
es: “Hay que enfatizar que la imposibilidad de asociar eventos con puntos en el tiempo usando sistemas distribuidos fue el problema sin solución que impedía la existencia de un libro contable descentralizado, hasta que Satoshi Nakamoto inventó la solución.”

source: Decentralized Time
es: Tiempo Descentralizado

source: Time brings all things to pass.
es: El tiempo hace que todas las cosas pasen.

source: Aeschylus (525 BC – 456 BC)
es: - Aeschylus (525 AC - 456 AC)

source: Time and order have a very intimate relationship.
es: El tiempo y el orden tienen una relación íntima.

source: As Leslie Lamport pointed out in his 1978 paper Time, Clocks, and the Ordering of Events in a Distributed System:
es: Como Leslie Lamport dijo en su publicación de 1978, Tiempo, Relojes, y el Orden de Eventos en un Sistema Distribuido:

source: The concept of time is fundamental to our way of thinking.
es: El concepto del tiempo es fundamental en nuestra manera de pensar.

source: It is derived from the more basic concept of the order in which events occur.
es: Se deduce del básico concepto del orden en el que las cosas ocurren.

source: Absent a central point of coordination, seemingly intuitive notions of “before,” “after,” and “simultaneously” break down.
es: Si no tienes una autoridad central que coordine, aparentes intuitivas nociones del “antes”, “después” y “simultáneo” pierden sentido.

source: In the words of Lamport:
es: En las palabras de Lamport:

source: the concept of ‘happening before’ defines an invariant partial ordering of the events in a distributed multiprocess system.
es: El concepto de ‘sucedió antes’ define un imparcial orden de los eventos en un sistema multiprocesos distribuído.

source: Phrased differently:
es: Dicho de otra forma:

source: Who should be in charge of time if putting someone in charge is not allowed?
es: ¿Quién debería estar a cargo del tiempo si poner a alguien a cargo no está permitido?

source: How can you have a reliable clock if there is no central frame of reference?
es: ¿Cómo puedes lograr tener un reloj confiable si no hay un marco central de referencia?

source: You might think that solving this problem is easy because everyone could just use their own clock.
es: Puedes pensar que resolver este problema es fácil porque cada uno puede usar su propio reloj.

source: This only works if everyone’s clock is accurate, and, more importantly, everyone plays nice.
es: Esto solo funciona si los relojes de todos son precisos, y, más importante, si nadie hace trampa.

source: In an adversarial system, relying on individual clocks would be a disaster.
es: En un sistema distribuído, confiar en relojes individuales sería un desastre.

source: And, because of relativity, it does not work consistently across space.
es: Y, debido a la relatividad, no funciona consistentemente a través del espacio.

source: As a thought experiment, imagine how you could cheat the system if everyone was in charge of keeping the time for themselves.
es: A modo de experimento mental, imagínate cómo podrías engañar al sistema si cada uno fuera responsable de su propio tiempo.

source: You could pretend that the transaction you’re sending now is actually from yesterday — it just got delayed for some reason — thus, you would still have all the money that you’ve spent today.
es: Podrías pretender que la transacción que estás enviando hoy es de ayer -solo se demoró por alguna razón- por lo tanto, tendrías todavía el dinero que gastaste ayer.

source: Because of the asynchronous communication that is inherent in every decentralized system, this scenario is more than a theoretical thought experiment.
es: Debido a que la comunicación es inherentemente asincrónica en todo sistema distribuido, este escenario es más que un experimento mental.

source: Messages do indeed get delayed, timestamps are inaccurate, and thanks to relativistic effects and the natural speed limit of our universe, it is anything but easy to tell apart the order of things absent of a central authority or observer.
es: Los mensajes realmente se retrasan, las marcas de tiempo son imprecisas, y gracias a los efectos de la relatividad y el límite natural de velocidad del universo, no es nada fácil saber cual es el orden de las cosas sin tener una autoridad central u observador.

source: Who’s there?
es: ¿Quién es?

source: An Asynchronous Joke
es: Una broma asincrónica

source: To better illustrate the impossibility of the problem, let’s look at a concrete example.
es: Para ilustrar mejor la imposibilidad del problema, miremos un ejemplo concreto.

source: Imagine that you and your business partner both have access to your company bank account.
es: Imagina que tú y tu compañera de negocios tienen acceso a la cuenta bancaria de la empresa.

source: You do business all over the world, so your bank account is in Switzerland, you are in New York, and your business partner is in Sydney.
es: Hacen negocios alrededor del mundo, así que la cuenta bancaria está en Suiza, tú estás en Nueva York y tu compañera está en Sydney.

source: For you, it is January 3rd, and you are enjoying a beautiful Sunday evening at your hotel.
es: Para ti, es el 3 de Enero, y estás disfrutando de una hermosa mañana de sábado en el hotel.

source: For her, it’s Monday morning already, so she decides to buy breakfast using the debit card of your shared bank account.
es: Para ella, ya es Lunes a la mañana, así que decide comprarse un desayuno con la tarjeta de débito de la cuenta bancaria compartida.

source: The cost is $27.
es: El costo es de $27.

source: The available balance is $615.
es: El saldo disponible es de $615.

source: The local time is 8:21 am.
es: La hora local es 8:21 am.

source: At the same time, you are about to pay for your stay with another debit card linked to the same bank account.
es: Al mismo tiempo, estás por pagar tu estadía con otra tarjeta de débito de la misma cuenta bancaria.

source: The cost is $599.
es: El costo es de $599.

source: The local time is 5:21 pm.
es: La hora local es 5:21 pm.

source: So it comes to be that — at exactly the same moment — you both swipe the card.
es: Así que ahí viene el problema -al mismo tiempo- ambos pasan la tarjeta.

source: What happens?
es: ¿Qué sucede?

source: Dear physicists, please excuse my use of “the same moment” — we will ignore relativistic effects and the fact that there is no absolute time in our universe for now.
es: Queridos físicos, perdonen mi uso de “al mismo tiempo” -vamos a ignorar los efectos relativistas y el hecho de que no hay un tiempo absoluto en nuestro universo por ahora.

source: We will also ignore that the concept of synchronous events doesn’t really exist.
es: También vamos a ignorar que el concepto de eventos sincrónicos no existe realmente.

source: Bitcoin is complicated enough as it is!
es: !Bitcoin es lo suficientemente complicado de por sí!

source: The central ledger at your bank will probably receive one transaction before the other one, so one of you will be lucky, the other not so much.
es: El libro contable central de tu banco probablemente reciba una transacción antes que la otra, así que alguno de los dos tendrá suerte, el otro no mucha.

source: If the transactions happen to arrive in the same tick — let’s say in the same millisecond — the bank would have to decide who gets to spend the money.
es: Si la transacción realmente llega al mismo tiempo -digamos, en el mismo milisegundo- el banco tendrá que decidir quién gasta el dinero.

source: Now, what would happen if there was no bank?
es: Ahora, ¿Qué hubiera pasado si no hubiera un banco?

source: Who decides who was the first one to swipe?
es: ¿Quién decide quien pasó primero la tarjeta?

source: What if it wasn’t only you two, but hundreds or even thousands of people coordinating?
es: ¿Y qué tal si no hubiera solo dos, sino cientos o miles de personas en simultáneo?

source: What if you didn’t trust those people?
es: ¿Y qué sucede si no confías en ninguna de esas personas?

source: What if some of those people are trying to cheat, e.g., by setting their clocks back so that it looks like they spent the money a couple of minutes earlier?
es: ¿Qué pasaría si algunas de esas personas quisieran hacer trampa, por ejemplo, retrocediendo su reloj haciendo parecer que ellos gastaron el dinero antes?

source: A time-related tool [is] needed to establish a canonical ordering and to enforce a unique history in the absence of any central coordinator.
es: Una herramienta dedicada al tiempo es necesaria para establecer un orden y hacer cumplir una única historia en la ausencia de un coordinador central.<br>

source: Giacomo Zucco, Discovering Bitcoin (2019)
es: - Giacomo Zucco, Descubriendo Bitcoin (2019)

source: This problem is precisely why all previous attempts of digital cash required a centralized registry.
es: Este problema es precisamente el causante de que todos los intentos anteriores de dinero digital requieran de un registro centralizado.

source: You always had to trust someone to correctly identify the order of things.
es: Siempre tienes que confiar en alguien para identificar correctamente el orden de las cosas.

source: A centralized party was required to keep the time.
es: Una autoridad central es requerida para que esté a cargo del tiempo.

source: Bitcoin solves this problem by re-inventing time itself.
es: Bitcoin resuelve este problema re inventando el tiempo en sí mismo.

source: It says no to seconds and yes to blocks.
es: Le dice no a los segundos y si a los bloques.

source: Keeping the Time, One Block at a Time
es: Midiendo el tiempo, un bloque a la vez

source: Time’s glory is to calm contending kings, To unmask falsehood and bring truth to light, To stamp the seal of time in aged things, To wake the morn and sentinel the night, To wrong the wronger till he render right;
es: Es la gloria del Tiempo calmar enemistades, revelar falsedades y a la verdad dar brillo, dar el sello del Tiempo a las cosas más viejas, ser celador de día y de noche guardián, maltratar al injusto hasta que entre en razón.

source: William Shakespeare, The Rape of Lucrece (1594)
es: William Shakespeare, La violación de Lucrecia (1709)

source: All clocks rely on periodic processes, something that we might call a “tick.”
es: Todos los relojes necesitan de un proceso periódico, algo que llamamos un “tick”.

source: The familiar tick-tock of a grandfather’s clock is, in essence, the same as the molecular-atomic buzzing of our modern Quartz and Caesium clocks.
es: El familiar tick-tock del reloj del abuelo es, en esencia, el mismo zumbido-atómico de tu reloj de Cuarzo.

source: Something swings — or oscillates — and we simply count these swings until it adds up to a minute or a second.
es: Algo se balancea -u oscila- y nosotros simplemente contamos eso hasta que sume minutos o segundos.

source: For large pendulum clocks, these swings are long and easy to see.
es: Para relojes de grandes péndulos, esos balanceos son largos y fáciles de ver.

source: For smaller and more specialized clocks, special equipment is required.
es: Para pequeños y más especializados relojes, un equipamiento especial es requerido.

source: The frequency of a clock — how often it ticks — depends on its use-case.
es: La frecuencia de un reloj -que tan rápido hace tick- depende de su caso de uso.

source: Most clocks have a fixed frequency.
es: La mayoría de relojes tienen una frecuencia fija.

source: After all, we want to know the time precisely.
es: Después de todo, queremos saber el tiempo de forma precisa.

source: There are, however, clocks that have a variable frequency.
es: Hay, sin embargo, relojes que tienen frecuencia variable.

source: A metronome, for example, has a variable frequency that you can set before you make it tick.
es: Un metrónomo, por ejemplo, tiene una frecuencia variable que puedes elegir antes de hacerlo funcionar.

source: While a metronome keeps its pace constant once it is set, Bitcoin’s time varies for each tick because its internal mechanism is probabilistic.
es: Mientras que un metrónomo se mantiene constante una vez que comenzó, el tiempo de Bitcoin varía en cada tick porque su mecanismo interno es probabilístico.

source: The purpose, however, is all the same:
es: El objetivo, sin embargo, es el mismo;

source: keep the music alive, so the dance can continue.
es: mantener la música viva, así el baile puede continuar.

source: Clock
es: Reloj

source: Tick Frequency
es: Frecuencia del tick

source: Grandfather’s clock
es: Reloj del abuelo

source: Metronome
es: Metrónomo

source: Quartz watch
es: Reloj de cuarzo

source: Caesium-133 atomic clock
es: Reloj atómico Caesium-133

source: 1 block
es: 1 bloque

source: * first block (6 days)
es: * primer bloque (6 días)

source: ** timestamps between blocks can show a negative delta
es: ** el tiempo entre bloques puede mostrar un delta negativo

source: The fact that Bitcoin is a clock is hiding in plain sight.
es: El hecho de que Bitcoin es un reloj está escondido a la vista de todos.

source: Indeed, Satoshi points out that the Bitcoin network as a whole acts as a clock, or, in his words:
es: Por supuesto, Satoshi señala que la red de Bitcoin actúa como un reloj, o, en sus palabras:

source: a distributed timestamp server.
es: un sistema distribuído de marcas de tiempo.

source: In this paper, we propose a solution to the double-spending problem using a peer-to-peer distributed timestamp server to generate computational proof of the chronological order of transactions.
es: En este documento, proponemos una solución al problema del doble-gasto usando un servidor distribuido par-a-par de marcas de tiempo para generar pruebas computacionales que aseguren el orden cronológico de las transacciones.

source: That timestamping was the root problem to be solved is also apparent by examining the reference at the end of the Bitcoin whitepaper.
es: Esas marcas de tiempo siendo la raíz del problema a resolver es también visible si examinamos las referencias al final del documento que dio origen al Bitcoin.

source: Out of the eight references in total, three are about timestamping:
es: De ocho referencias en total, tres son sobre marcas de tiempo.

source: How to time-stamp a digital document by S. Haber, W.S.
es: Como marcar el tiempo en un documento digital por S. Haber, W.S.

source: Stornetta (1991) Improving the efficiency and reliability of digital time-stamping by D. Bayer, S. Haber, W.S.
es: Stornetta (1991) Mejorar la eficiencia y fiabilidad de las marcas de tiempo digitales por D. Bayes, S. Haber, W.S

source: Stornetta (1992) Design of a secure timestamping service with minimal trust requirements by H. Massias, X.S Avila y J.J.
es: Stornetta (1992) El diseño de un servicio seguro de marcas de tiempo con un mínimo de confianza por H. Massias, X.S Avila y J.J.

source: Quisquater (May 1999)
es: Quisquater (1999)

source: As Haber and Stornetta outlined in 1991, digital time-stamping is about computationally practical procedures that make it infeasible for a user — or an adversary, for that matter — to either back-date or forward-date a digital document.
es: Como Haber y Stornetta mostraron en 1991, las marcas de tiempo digitales tratan sobre el armado de procedimientos computacionales para hacer que un usuario no pueda -o un adversario, en este caso- modificar la fecha de un documento hacia atrás o hacia adelante en el tiempo.

source: Contrary to physical documents, digital documents are easy to tamper with, and the change doesn’t necessarily leave any tell-tale signs on the physical medium itself.
es: Al contrario de los documentos físicos, los documentos digitales son fáciles de adulterar y los cambios no necesariamente dejan signos visibles.

source: In the digital realm, forgeries and manipulations can be perfect.
es: En el mundo digital, los cambios y manipulaciones pueden ser perfectas.

source: The malleable nature of information makes time-stamping digital documents an elaborate and sophisticated process.
es: La naturaleza maleable de la información hace que marcar el tiempo en un documento digital sea un proceso elaborado y sofisticado.

source: Naive solutions do not work.
es: Soluciones a la ligera no funcionan.

source: Take a text document, for example.
es: Toma un documento de texto, por ejemplo.

source: You can’t simply add the date at the end of the document since everyone — including yourself — could simply change the date in the future.
es: No puedes agregar la fecha al final del documento porque todo el mundo -incluido tú mismo- podrían cambiar la fecha en un futuro.

source: You could also make up any date in the first place.
es: Podrías hasta inventar una fecha en primer lugar.

source: Time is a Causal Chain
es: El tiempo es una cadena causal

source: In an extreme view, the world can be seen as only connections, nothing else.
es: “Mirándolo de forma extrema, el mundo puede ser visto solo como conexiones, nada más.”

source: Tim Berners-Lee, Weaving the Web (1999)
es: - Tim Berners-Lee, Tejiendo la Red (1999)

source: Making up dates is a general problem, even in the non-digital realm.
es: Inventar fechas es un problema general, incluso en el reino no-digital.

source: What is known in the kidnapping world as “Authentication by Newspaper” is a general solution to the problem of arbitrary timestamps.
es: Lo que se conoce en el mundo de los secuestros como “Autenticación por Periódico” es una solución general al problema de marcas de tiempo arbitrarias.

source: Proof of Time
es: Prueba de tiempo

source: This works because a newspaper is hard to fake and easy to verify.
es: Esto funciona porque un periódico es difícil de falsificar y es fácil de verificar.

source: It is hard to fake because today’s front page refers to yesterday’s events, events that could not have been predicted by the kidnapper if the picture would be weeks old.
es: Es difícil de falsificar porque las portadas de hoy refieren a eventos de ayer, eventos que no podrían haber sido predichos por el secuestrador si la imagen tuviera semanas de antigüedad.

source: By proxy of these events, the picture is proof that the hostage was still alive on the day the newspaper came out.
es: Por delegación de estos eventos, la imagen es prueba de que el rehén estaba aún vivo el día en que el periódico se publicó.

source: This method highlights one of the key concepts when it comes to time: causality.
es: Este método resalta uno de los conceptos clave en cuanto al tiempo: causalidad.

source: The arrow of time describes the causal relationship of events.
es: La línea de tiempo describe la relación causal de eventos.

source: No causality, no time.
es: Sin causalidad no hay tiempo.
